[
  {
    "id": 1,
    "idea": "Get your fortune told - Go to a fortune teller and have your tarot cards read. Whether or not your fortune actually comes true, it's a fun way to think about your future together.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 2,
    "idea": "Use a coloring book - Coloring isn't just for kids! Put on some relaxing music and split a box of crayons, markers, or pencils to go to town.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 3,
    "idea": "Scrapbook - Move your favorite photos off your phone and into your hands. You can save ticket stubs and love notes alongside pictures of your favorite times together.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 4,
    "idea": "Make cocktails at home - Pick a few cocktail recipes and practice mixing drinks together. It's fun, creative, and you get to enjoy the results.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 5,
    "idea": "Build a pillow fort - Grab your coziest blankets and pillows and fill your fort with twinkle lights, snacks, and a romantic playlist to have your own secret place to snuggle.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 6,
    "idea": "Play a video game - Download something slow and low stakes like Animal Crossing or The Sims to play collaboratively, or competitive games like Mario Kart to battle it out.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 7,
    "idea": "Play with clay - Embrace nostalgia and buy some colorful clay. It's a hands-on way to embrace your creativity, with lots of potential to get silly.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 8,
    "idea": "Build a craft kit - You can try Lego, model replicas, or any other kind of kit that includes all the materials and instructions. It's great practice for that Ikea furniture.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 9,
    "idea": "Practice a language together - Pick a language you both want to learn and spend the evening practicing basic phrases and having conversations.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 10,
    "idea": "Redecorate - Do you have new artwork to hang on the wall or a beautiful vintage rug you scored at the flea market? Put on some upbeat tunes and redecorate together.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 11,
    "idea": "Restaurant hop - If you've got your favorite spot's menu just about memorized, check out a few new places instead. Visit a food hall or head to an area with different restaurants.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 12,
    "idea": "Visit a local art exhibit - Check out a temporary art exhibit or gallery opening for a cultural evening together.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 13,
    "idea": "Watch a local theater production - Find a community theater or small production for an intimate cultural experience.",
    "category": "cultural",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 14,
    "idea": "Try an escape room - Put your logic to the test and try to solve the puzzle before time runs out.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 15,
    "idea": "Make a fun new recipe - Even if you're not much of a cook, trying out a new dish can result in lots of laughs. And when you're done, you get to eat the results.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 16,
    "idea": "Play a board game - Drag out the classics or try a brand new one for a healthy dose of competition. Toss in a friendly wager to spice things up a little.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 17,
    "idea": "Throw a casino night - If they call you Lady Luck, see if your partner can roll snake eyes and win your heart. That, or play cards with that week's chore list on the line.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 18,
    "idea": "Play hide 'n seek - It's not just for kids anymore.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 19,
    "idea": "Look through old photos - Pull out the albums and get ready for an awwww-fest. Share stories of your childhoods and your awkward teen years.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 20,
    "idea": "Visit an antique store - Browse a local antique store and look for interesting items.",
    "category": "adventurous",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 21,
    "idea": "Make a craft together - Creativity feels even more satisfying when you do a project with your sweetheart. Don't worry if you're not a pro artist; there's beauty in imperfection.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 22,
    "idea": "See a comedy show - Laughing gets endorphins flowing, and comedy often comes cheaper than other forms of live entertainment. Even really bad standup can be fun, in its own way.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 23,
    "idea": "Visit an open house - Check out a local open house or estate sale.",
    "category": "adventurous",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 24,
    "idea": "Tackle a home improvement project - If you've been meaning to hang some shelves or finally cleaning out your closet, enlist the help of your main squeeze. Doing it together will make the task go by faster.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 25,
    "idea": "Do karaoke - Everyone's a star at karaoke, especially if you can find the kind with private rooms. The sappier ballads you belt out, the better.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 26,
    "idea": "Go ax-throwing - As soon as you let the first one fly, you'll understand why ax-throwing is so popular. It's also a great way to unload some stress.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 27,
    "idea": "Put together a puzzle - There's something so satisfying about finally clicking that last piece into place, plus it's good for the ol' noodle.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 28,
    "idea": "Go bowling - This is one instance in which you actually want to strike out.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 29,
    "idea": "Have a romantic dinner at home - Cook a special meal and set up a romantic atmosphere.",
    "category": "romantic",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 30,
    "idea": "Challenge them at an arcade - Go a few rounds at Ms. Pacman and Big Deer Hunter for a unique night out that will bring out your competitive side.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 31,
    "idea": "Try a new fancy coffee or tea - If you usually take it black or with just sugar or cream, branch out! Hit up a local coffee shop and try the most offbeat offering they've got.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 32,
    "idea": "Visit a museum exhibit - Pick a specific exhibit or section to explore together rather than the entire museum.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 33,
    "idea": "Go out for dessert - I don't know about you, but I'm always too full to get dessert after a nice dinner. Make dessert the main event instead.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 34,
    "idea": "Cook a new recipe together - Pick a challenging recipe you've never tried and cook it together.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 35,
    "idea": "Visit a local market - Browse a farmers market and pick up fresh ingredients for a meal.",
    "category": "foodie",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 36,
    "idea": "Try a new restaurant - Whether it's a cuisine you've never tried or a place that just opened, trying something new together is always an adventure.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 37,
    "idea": "Have a picnic - Pack a basket with your favorite foods, grab a blanket, and head to a park or beach. Bonus points if you bring a bottle of wine.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 38,
    "idea": "Have a wine tasting at home - Buy a few different wines and taste them together.",
    "category": "romantic",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 39,
    "idea": "Dance together at home - Put on some music and practice dancing together in your living room.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 40,
    "idea": "Take a short nature walk - Find a local park or trail for a leisurely walk together.",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 41,
    "idea": "Rent paddleboards for an hour - Many lakes offer hourly paddleboard rentals.",
    "category": "active",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 42,
    "idea": "Try indoor rock climbing - Many gyms offer day passes for indoor climbing.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 43,
    "idea": "Do yoga together at home - Follow a yoga video or app together.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 44,
    "idea": "Go for a swim - Visit a local pool or beach for a refreshing swim.",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 45,
    "idea": "Play mini golf - It's fun, competitive, and usually pretty affordable. Plus, you get to be outside.",
    "category": "fun",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 46,
    "idea": "Have a movie night at home - Set up a cozy movie viewing area with blankets and snacks.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 47,
    "idea": "Stargaze together - There's just something inherently romantic about staring up at the night sky. Bring a blanket to the backyard or a local park.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 48,
    "idea": "Watch the sunset - There's a reason so many romantic movies end this way.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 49,
    "idea": "Order each other's meal - See how well you know your loved one's tastes by ordering for the other at dinner. No swapping back when the food arrives!",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 50,
    "idea": "Make your own pizza - Yes, including the dough. Top it with all of the classics, or go with personal pies and challenge each other to come up with the tastiest new combo.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 51,
    "idea": "Read a book together - Pick a book and take turns reading chapters aloud to each other.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 52,
    "idea": "Have a backyard campout - Set up a tent in your backyard and spend the evening outside.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 53,
    "idea": "Cook a fancy dinner for two - Plan and cook a multi-course meal together.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 54,
    "idea": "Have a themed movie night - But make it a theme. Choose a flick and add snacks to match. Think The Godfather and cannoli or Ratatouille and, well, you know.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 55,
    "idea": "Make a romantic playlist - Remember when you used to exchange mix tapes with your crush back in the day? Thanks to streaming services, it's easier than ever to create a musical journey through your relationship.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 56,
    "idea": "Paint and sip - If you've got a paint nite program nearby, it's a fun and easy date. If not, get some canvasses, pour some bevies, and throw your own.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 57,
    "idea": "Try tie-dye - You may have noticed that all kinds of things are tie-dyed lately. Get in on the trend by making your own. Even if it doesn't come out perfectly, you'll have a fun memory.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 58,
    "idea": "Watch a sports game - Even high school sports can get your adrenaline going if you get really, really into it. And, in most cases, you can watch from your couch.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 59,
    "idea": "Have a breakfast date - Turn date night on its head and start your day with some couple time. Mimosas highly encouraged, if you partake.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 60,
    "idea": "Have a staycation at home - Transform your home into a vacation destination for the evening.",
    "category": "adventurous",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 61,
    "idea": "Build a snowman (or a sand sculpture) - Make the most of the weather by creating a new friend.",
    "category": "creative",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 62,
    "idea": "Shop for charity - Food pantries, homeless shelters and community organizations need supplies all year round. Spread the love while spending quality time with your partner.",
    "category": "chill",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 63,
    "idea": "Listen to podcasts - For a twist on the usual movie night, cuddle up and turn on a podcast instead.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 64,
    "idea": "Do couples' yoga - Getting bendy together can really heat things up, plus you're doing something good for your body and mind.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 65,
    "idea": "Play 'never have I ever' - Asking each other to get deep can reveal some new things about your loved one.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 66,
    "idea": "Make a video together - The only thing more fun than watching reality TV is making your own. Use your phone to shoot a cooking video, do a tutorial or even give each other makeovers.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 67,
    "idea": "Write each other love letters - Getting your feelings down on paper can ignite some real sparks, plus create a keepsake for years to come.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 68,
    "idea": "Share family stories - Spend the evening sharing stories about your families and backgrounds.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 69,
    "idea": "Plant some herbs or flowers - Buy some seeds or small plants and spend the evening potting them together. It's therapeutic and you'll have something to care for.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 70,
    "idea": "Make a date night bucket list - Create a list of fun date ideas you want to try together.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 71,
    "idea": "Visit a flea market - Browse a local flea market for unique finds.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 72,
    "idea": "Take a short scenic drive - Find a beautiful route near your home for a short drive.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 73,
    "idea": "Visit a local garden - Find a beautiful local garden for a peaceful stroll.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 74,
    "idea": "Visit a local event - Check for local events, fairs, or small festivals.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 75,
    "idea": "Take a photography walk - Bring your phones or cameras and take turns being the photographer. You'll end up with some great memories.",
    "category": "creative",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 76,
    "idea": "Have a beer or wine tasting at home - Buy a variety of craft beers or wines and taste them together.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 77,
    "idea": "Cook a new recipe together - Pick a challenging recipe you've never tried and cook it together.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 78,
    "idea": "Order from different food trucks - Find a food truck park and try dishes from different trucks.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 79,
    "idea": "Have a progressive dinner - Start with appetizers at one place, main course at another, and dessert at a third.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 80,
    "idea": "Buy ingredients and cook together - Visit a farmers market, pick fresh ingredients, then cook a meal.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 81,
    "idea": "Learn a dance routine - Pick a popular dance and learn it together from YouTube.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 82,
    "idea": "Try bouldering for an hour - Many gyms offer bouldering walls with day passes.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 83,
    "idea": "Do partner yoga poses - Try some simple partner yoga poses together.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 84,
    "idea": "Rent bikes for an hour - Many cities have bike rental programs for short rides.",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 85,
    "idea": "Walk in a local park - Find a beautiful local park for a peaceful walk.",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 86,
    "idea": "Go ice skating - Visit a local ice rink for a fun skating session.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 87,
    "idea": "Go roller skating - Visit a roller rink for a retro skating date.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 88,
    "idea": "Try martial arts moves - Learn some basic martial arts moves together.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 89,
    "idea": "Rent kayaks for an hour - Many lakes offer hourly kayak rentals.",
    "category": "active",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 90,
    "idea": "Do a home workout together - Follow a fitness video or app together.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 91,
    "idea": "Listen to live music at a local venue - Find a small local band or open mic night for an intimate musical experience.",
    "category": "cultural",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 92,
    "idea": "Read poetry to each other - Pick your favorite poems and take turns reading them aloud in a cozy setting.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 93,
    "idea": "Watch an educational video together - Pick an interesting TED talk or documentary and discuss it afterward.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 94,
    "idea": "Have a book discussion night - Pick a book you've both read and spend the evening discussing your favorite parts.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 95,
    "idea": "Have a foreign film night - Pick a foreign film you've never seen and watch it together with snacks.",
    "category": "cultural",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 96,
    "idea": "Cook a cultural meal together - Pick a cuisine you've never tried and cook a traditional meal together.",
    "category": "cultural",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 97,
    "idea": "Take a historical walking tour - Many cities offer evening walking tours of historical areas.",
    "category": "cultural",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 98,
    "idea": "Do science experiments at home - Try some simple kitchen science experiments together.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 99,
    "idea": "Stargaze with an app - Use a stargazing app to identify constellations and planets together.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 100,
    "idea": "Watch nature documentaries - Pick an interesting nature documentary and watch it together.",
    "category": "cultural",
    "budget": "medium",
    "location": "outdoor"
  }
]