[
  {
    "id": 1,
    "idea": "Get your fortune told - Go to a fortune teller and have your tarot cards read. Whether or not your fortune actually comes true, it's a fun way to think about your future together.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 2,
    "idea": "Use a coloring book - Coloring isn't just for kids! Put on some relaxing music and split a box of crayons, markers, or pencils to go to town.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 3,
    "idea": "Scrapbook - Move your favorite photos off your phone and into your hands. You can save ticket stubs and love notes alongside pictures of your favorite times together.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 4,
    "idea": "Learn to bartend - Pick a gourmet drink and practice your mixology skills to end the night with a delicious beverage you can serve at your next gathering.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 5,
    "idea": "Build a pillow fort - Grab your coziest blankets and pillows and fill your fort with twinkle lights, snacks, and a romantic playlist to have your own secret place to snuggle.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 6,
    "idea": "Play a video game - Download something slow and low stakes like Animal Crossing or The Sims to play collaboratively, or competitive games like Mario Kart to battle it out.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 7,
    "idea": "Play with clay - Embrace nostalgia and buy some colorful clay. It's a hands-on way to embrace your creativity, with lots of potential to get silly.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 8,
    "idea": "Build a craft kit - You can try Lego, model replicas, or any other kind of kit that includes all the materials and instructions. It's great practice for that Ikea furniture.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 9,
    "idea": "Learn a new language - Learning is sexy—and so is flirting in another language. Whether you take proper lessons or fire up a free program online.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 10,
    "idea": "Redecorate - Do you have new artwork to hang on the wall or a beautiful vintage rug you scored at the flea market? Put on some upbeat tunes and redecorate together.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 11,
    "idea": "Restaurant hop - If you've got your favorite spot's menu just about memorized, check out a few new places instead. Visit a food hall or head to an area with different restaurants.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 12,
    "idea": "Tour an art gallery - Get acquainted with up-and-coming artists' work, or pick an opening night of one of your favorites.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 13,
    "idea": "See a play - Theatre kids will appreciate an evening or midday show whether it's on or off Broadway.",
    "category": "cultural",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 14,
    "idea": "Try an escape room - Put your logic to the test and try to solve the puzzle before time runs out.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 15,
    "idea": "Make a fun new recipe - Even if you're not much of a cook, trying out a new dish can result in lots of laughs. And when you're done, you get to eat the results.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 16,
    "idea": "Play a board game - Drag out the classics or try a brand new one for a healthy dose of competition. Toss in a friendly wager to spice things up a little.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 17,
    "idea": "Throw a casino night - If they call you Lady Luck, see if your partner can roll snake eyes and win your heart. That, or play cards with that week's chore list on the line.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 18,
    "idea": "Play hide 'n seek - It's not just for kids anymore.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 19,
    "idea": "Look through old photos - Pull out the albums and get ready for an awwww-fest. Share stories of your childhoods and your awkward teen years.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 20,
    "idea": "Go antique hunting - You'll be amazed what kinds of gems you can find at an antique store, not to mention the creepy AF tchotchkes you'll run into.",
    "category": "adventurous",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 21,
    "idea": "Make a craft together - Creativity feels even more satisfying when you do a project with your sweetheart. Don't worry if you're not a pro artist; there's beauty in imperfection.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 22,
    "idea": "See a comedy show - Laughing gets endorphins flowing, and comedy often comes cheaper than other forms of live entertainment. Even really bad standup can be fun, in its own way.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 23,
    "idea": "Go to an open house or estate sale - Even if you have zero plans to buy a home, looking inside someone else's is the best (and least creepy) kind of voyeurism.",
    "category": "adventurous",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 24,
    "idea": "Tackle a home improvement project - If you've been meaning to hang some shelves or finally cleaning out your closet, enlist the help of your main squeeze. Doing it together will make the task go by faster.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 25,
    "idea": "Do karaoke - Everyone's a star at karaoke, especially if you can find the kind with private rooms. The sappier ballads you belt out, the better.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 26,
    "idea": "Go ax-throwing - As soon as you let the first one fly, you'll understand why ax-throwing is so popular. It's also a great way to unload some stress.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 27,
    "idea": "Put together a puzzle - There's something so satisfying about finally clicking that last piece into place, plus it's good for the ol' noodle.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 28,
    "idea": "Go bowling - This is one instance in which you actually want to strike out.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 29,
    "idea": "Stay at a bed and breakfast - Whether you go old-school or rent an Airbnb for the night, bed and breakfasts feel like sneaking into someone else's house, except you're totally allowed to be there.",
    "category": "romantic",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 30,
    "idea": "Challenge them at an arcade - Go a few rounds at Ms. Pacman and Big Deer Hunter for a unique night out that will bring out your competitive side.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 31,
    "idea": "Try a new fancy coffee or tea - If you usually take it black or with just sugar or cream, branch out! Hit up a local coffee shop and try the most offbeat offering they've got.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 32,
    "idea": "Explore a museum - If you haven't been to your nearest museum since your class field trip, it's time to make a trip. Learning is sexy, don't you think?",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 33,
    "idea": "Go out for dessert - I don't know about you, but I'm always too full to get dessert after a nice dinner. Make dessert the main event instead.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 34,
    "idea": "Take a cooking class - Whether you're a kitchen newbie or a seasoned chef, there's always something new to learn. Plus, you get to eat your homework.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 35,
    "idea": "Go to a farmers market - Even if you don't cook, farmers markets are fun to explore. Pick up some fresh flowers, sample local honey, and people-watch.",
    "category": "foodie",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 36,
    "idea": "Try a new restaurant - Whether it's a cuisine you've never tried or a place that just opened, trying something new together is always an adventure.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 37,
    "idea": "Have a picnic - Pack a basket with your favorite foods, grab a blanket, and head to a park or beach. Bonus points if you bring a bottle of wine.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 38,
    "idea": "Go wine tasting - Many wineries offer tastings for a reasonable price, and you can learn about different varietals while enjoying each other's company.",
    "category": "romantic",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 39,
    "idea": "Take a ballroom dance class - Learn the waltz, foxtrot, or tango together. It's elegant, romantic, and a great way to get close.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 40,
    "idea": "Go hiking - Find a trail near you and spend the day exploring nature together. Don't forget to pack water and snacks!",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 41,
    "idea": "Try paddleboarding - Many lakes and beaches offer paddleboard rentals. It's a fun way to explore the water together.",
    "category": "active",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 42,
    "idea": "Go rock climbing - Many gyms offer beginner classes, and it's a great way to build trust and communication.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 43,
    "idea": "Take a yoga class - Many studios offer couples classes, or you can follow along with a video at home.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 44,
    "idea": "Go swimming - Whether it's at a pool, lake, or beach, swimming together is refreshing and fun.",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 45,
    "idea": "Play mini golf - It's fun, competitive, and usually pretty affordable. Plus, you get to be outside.",
    "category": "fun",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 46,
    "idea": "Go to a drive-in movie - Many drive-ins still play double features, so you get twice the films for your buck. Besides, it's delightfully retro.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 47,
    "idea": "Stargaze together - There's just something inherently romantic about staring up at the night sky. Bring a blanket to the backyard or a local park.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 48,
    "idea": "Watch the sunset - There's a reason so many romantic movies end this way.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 49,
    "idea": "Order each other's meal - See how well you know your loved one's tastes by ordering for the other at dinner. No swapping back when the food arrives!",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 50,
    "idea": "Make your own pizza - Yes, including the dough. Top it with all of the classics, or go with personal pies and challenge each other to come up with the tastiest new combo.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 51,
    "idea": "Start a book club - Select a new book to read and make a habit of discussing it every week. Follow up with new books for a standing date night routine.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 52,
    "idea": "Go camping - Snuggling under the stars is a cliché for a reason. Pitch a tent in the backyard if you don't have a campground nearby.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 53,
    "idea": "Throw a dinner party together - Invite a few other couples over and go all out making an apps-to-dessert meal. Placing cards and centerpieces are optional.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 54,
    "idea": "Have a themed movie night - But make it a theme. Choose a flick and add snacks to match. Think The Godfather and cannoli or Ratatouille and, well, you know.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 55,
    "idea": "Make a romantic playlist - Remember when you used to exchange mix tapes with your crush back in the day? Thanks to streaming services, it's easier than ever to create a musical journey through your relationship.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 56,
    "idea": "Paint and sip - If you've got a paint nite program nearby, it's a fun and easy date. If not, get some canvasses, pour some bevies, and throw your own.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 57,
    "idea": "Try tie-dye - You may have noticed that all kinds of things are tie-dyed lately. Get in on the trend by making your own. Even if it doesn't come out perfectly, you'll have a fun memory.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 58,
    "idea": "Watch a sports game - Even high school sports can get your adrenaline going if you get really, really into it. And, in most cases, you can watch from your couch.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 59,
    "idea": "Have a breakfast date - Turn date night on its head and start your day with some couple time. Mimosas highly encouraged, if you partake.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 60,
    "idea": "Swap houses with a friend - Enjoy a staycation for free by exchanging houses with a nearby pal. Living in someone else's shoes for the night or weekend feels like stepping into someone else's life.",
    "category": "adventurous",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 61,
    "idea": "Build a snowman (or a sand sculpture) - Make the most of the weather by creating a new friend.",
    "category": "creative",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 62,
    "idea": "Shop for charity - Food pantries, homeless shelters and community organizations need supplies all year round. Spread the love while spending quality time with your partner.",
    "category": "chill",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 63,
    "idea": "Listen to podcasts - For a twist on the usual movie night, cuddle up and turn on a podcast instead.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 64,
    "idea": "Do couples' yoga - Getting bendy together can really heat things up, plus you're doing something good for your body and mind.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 65,
    "idea": "Play 'never have I ever' - Asking each other to get deep can reveal some new things about your loved one.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 66,
    "idea": "Make a video together - The only thing more fun than watching reality TV is making your own. Use your phone to shoot a cooking video, do a tutorial or even give each other makeovers.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 67,
    "idea": "Write each other love letters - Getting your feelings down on paper can ignite some real sparks, plus create a keepsake for years to come.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 68,
    "idea": "Climb your family tree - Sit down with Ancestry.com and learn about your backgrounds. Or even better, interview an elderly family member to get personal stories about where you came from.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 69,
    "idea": "Cultivate a garden - Even if you live in an apartment, try your hand at growing a window garden. Plants make any dwelling feel like a home.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 70,
    "idea": "Build a bucket list - Sit down together and think big: No item is too out-there or mundane to plan ahead for the rest of your life as a couple.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 71,
    "idea": "Go to a flea market - You never know what treasures you'll find, and it's a great way to spend a few hours browsing and people-watching.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 72,
    "idea": "Take a scenic drive - Pick a direction and just drive. Stop at interesting places along the way and see where the road takes you.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 73,
    "idea": "Visit a botanical garden - Many cities have beautiful botanical gardens that are perfect for a romantic stroll.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 74,
    "idea": "Go to a local festival - Check your city's events calendar for festivals, fairs, and other community events.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 75,
    "idea": "Take a photography walk - Bring your phones or cameras and take turns being the photographer. You'll end up with some great memories.",
    "category": "creative",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 76,
    "idea": "Go to a local brewery or distillery - Many offer tours and tastings, and it's a fun way to learn about the brewing process.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 77,
    "idea": "Take a cooking class together - Learn to make pasta, sushi, or whatever cuisine interests you both.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 78,
    "idea": "Go to a food truck festival - Sample different cuisines without committing to a full meal at each place.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 79,
    "idea": "Have a progressive dinner - Start with appetizers at one place, main course at another, and dessert at a third.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 80,
    "idea": "Go to a farmers market and cook together - Pick up fresh ingredients and then go home to create a meal together.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 81,
    "idea": "Learn hip-hop dancing - Take a beginner hip-hop class and practice your moves together. It's energetic, fun, and a great workout.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 82,
    "idea": "Try indoor bouldering - Many gyms offer bouldering walls that don't require ropes. It's a great way to build strength and trust.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 83,
    "idea": "Practice partner yoga - Many studios offer couples classes or partner yoga sessions.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 84,
    "idea": "Go for a bike ride - Rent bikes or use your own and explore your city on two wheels.",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 85,
    "idea": "Take a nature walk - Find a scenic trail and spend the day exploring the great outdoors together.",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 86,
    "idea": "Go ice skating - Whether it's winter or an indoor rink, ice skating is fun and romantic.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 87,
    "idea": "Go roller skating - Many cities have roller rinks that are perfect for a retro date night.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 88,
    "idea": "Take a martial arts class - Many studios offer couples classes in karate, tai chi, or other martial arts.",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 89,
    "idea": "Try kayaking - Many lakes and rivers offer kayak rentals. It's a peaceful way to explore the water together.",
    "category": "active",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 90,
    "idea": "Take a fitness class together - Many gyms offer classes that you can do together.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 91,
    "idea": "Go to a concert - Whether it's a big arena show or a small local venue, live music is always a great date.",
    "category": "cultural",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 92,
    "idea": "Go to a poetry reading - Many bookstores and cafes host poetry readings that are free or low-cost.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 93,
    "idea": "Go to a lecture - Many universities and libraries offer free lectures on interesting topics.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 94,
    "idea": "Go to a book signing - Meet your favorite author and get your book signed together.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 95,
    "idea": "Attend a film festival - Many cities have film festivals that showcase independent and foreign films.",
    "category": "cultural",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 96,
    "idea": "Experience a cultural festival - Many cities have festivals celebrating different cultures with food, music, and dance.",
    "category": "cultural",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 97,
    "idea": "Go to a historical site - Learn about your city's history while spending time together.",
    "category": "cultural",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 98,
    "idea": "Go to a science museum - Many science museums have interactive exhibits that are fun for adults too.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 99,
    "idea": "Go to a planetarium - Many planetariums offer shows that are both educational and romantic.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 100,
    "idea": "Go to a zoo or aquarium - Many zoos and aquariums offer evening events that are perfect for dates.",
    "category": "cultural",
    "budget": "medium",
    "location": "outdoor"
  }
]
