[
  {
    "id": 1,
    "idea": "Sunset picnic with champagne and strawberries",
    "category": "romantic",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 2,
    "idea": "Cooking class for two - learn to make pasta together",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 3,
    "idea": "Stargazing with hot chocolate and blankets",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 4,
    "idea": "Board game night with wine and cheese",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 5,
    "idea": "Hiking adventure to a beautiful viewpoint",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 6,
    "idea": "Wine tasting at a local vineyard",
    "category": "romantic",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 7,
    "idea": "Dance lesson - salsa or tango for beginners",
    "category": "active",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 8,
    "idea": "Art gallery exploration with coffee afterwards",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 9,
    "idea": "Karaoke night at a private room",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 10,
    "idea": "Try a 3-part 'Yes Day': Each of you picks one surprise mini activity (like boba stop, quick hike, art store visit). Don't tell the other until it's time. Say yes to each activity and take a photo at each stop.",
    "category": "adventurous",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 11,
    "idea": "Do a DIY trivia night: Each person prepares 10 custom trivia questions about your relationship, shared memories, or favorite topics. Light candles, grab drinks, and compete for a prize like a foot rub or breakfast in bed.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 12,
    "idea": "Go to a bookstore or library together: Pick out a book for each other to read and explain why you chose it. Find a cozy spot nearby to read the first chapter together with coffee or tea.",
    "category": "chill",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 13,
    "idea": "Plan a spontaneous food crawl: Choose 3 local spots (one for drinks, one for appetizers, one for dessert). Rate each place together and create a shared food memory map afterward.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 14,
    "idea": "Create a vision board night: Gather old magazines, scissors, glue, or use Canva. Each of you makes a collage about future dreams and then shares the stories behind the images.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 15,
    "idea": "Do a 'Spotify Swap': Build a 5-song playlist for each other that reflects how you feel about them. Then go for a walk or drive while listening to each other's playlists and share your thoughts.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 16,
    "idea": "Take a scenic bike ride to a local park or quiet neighborhood. Pack snacks, a Bluetooth speaker, and take breaks to talk about your favorite childhood memories or future travel dreams. End by watching the sunset together from a bench or blanket.",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 17,
    "idea": "Plan a local photo scavenger hunt: Create a list of 10 fun or romantic photo challenges (like 'kiss under a mural' or 'find a heart-shaped object'). Explore your city together and take selfies at each spot. End with ice cream or a surprise treat.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 18,
    "idea": "Create a 'home spa night': Light candles, put on calming music, and take turns giving each other foot soaks, face masks, or neck massages. End with tea and a cozy cuddle in robes or pajamas.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 19,
    "idea": "Host a themed movie marathon: Pick a theme like '80s Night' or 'Movies That Made Us Cry.' Dress up, make themed snacks, and rate each movie on fun, romance, and rewatch value.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 20,
    "idea": "Go on a sunset mini road trip: Pick a direction and drive for 30 minutes, stopping at the quirkiest roadside attraction, café, or scenic spot. Bring a playlist and snacks to share on the way.",
    "category": "adventurous",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 21,
    "idea": "Have a 'dream life' planning date: Each of you grabs a journal and writes about your ideal life in 5 years—home, pets, travel, work, love. Share over drinks or coffee and circle anything you both wrote in common.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 22,
    "idea": "Have a blackout night: Turn off all the lights and electronics. Use candles and flashlights to play card games, tell stories, or do a DIY tasting of snacks you can eat in the dark.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 23,
    "idea": "Build a blanket fort in the living room: Add pillows, fairy lights, and snacks. Watch a movie or tell stories about what you were like as kids.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 24,
    "idea": "Create a couple's time capsule: Collect small items that represent your relationship right now. Write letters to each other and bury or hide them to open in a year.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 25,
    "idea": "Do a 'blind taste test' date: Blindfold each other and feed each other different foods. Try to guess what you're eating and rate the experience.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 26,
    "idea": "Have a 'midnight snack' date: Stay up late, make comfort food, and watch something silly on TV. It'll feel like a sleepover from when you were kids.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 27,
    "idea": "Do a 'restaurant roulette': Open a delivery app, close your eyes, and scroll. The first place you land on is where you order from. Try something you've never had, then rate it together like you're food critics.",
    "category": "foodie",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 28,
    "idea": "Create a couple's bucket list: Use paper, sticky notes, or a whiteboard and brainstorm everything you'd love to try—small or big. Categorize them (adventure, romantic, weird) and choose one to plan that night.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 29,
    "idea": "Take a sunset walk with a twist: Each of you brings 3 'surprise questions' written on index cards to ask along the way. They can be deep, funny, or romantic. It turns a simple walk into a heartfelt memory.",
    "category": "chill",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 30,
    "idea": "Do a DIY tasting night: Choose a theme like chocolates, cheeses, or sparkling waters. Get 5–6 varieties, make a scorecard, and take turns guessing origins or brands. Winner gets a small gift or coupon from the other.",
    "category": "fun",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 31,
    "idea": "Attend a free local event: Search community boards or Eventbrite for free pop-up events—art shows, markets, outdoor concerts. Dress up a bit and treat it like a spontaneous city date.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 32,
    "idea": "Have a 'technology detox' night: Put phones away and focus on each other. Play board games, cook together, or just talk without distractions.",
    "category": "chill",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 33,
    "idea": "Create a DIY photo booth: Set up a backdrop, use props, and take silly photos together. Print them out and create a mini album.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 34,
    "idea": "Go on a 'color hunt': Pick a color and find as many things in that color as possible while walking around your neighborhood. Take photos of your discoveries.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 35,
    "idea": "Have a 'breakfast for dinner' night: Make pancakes, eggs, bacon, and all the breakfast foods you love. Eat in pajamas and watch a feel-good movie.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 36,
    "idea": "Create a couple's playlist: Each of you adds 10 songs that remind you of your relationship. Listen to it while cooking dinner or going for a drive.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 37,
    "idea": "Do a 'swap day': Wear each other's clothes (if they fit) and try to act like each other for an hour. It's hilarious and surprisingly bonding.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 38,
    "idea": "Visit a farmers market and buy ingredients for a meal you've never cooked before. Go home and figure out how to make it together.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 39,
    "idea": "Have a 'paint night' at home: Get some canvases, paint, and follow a YouTube tutorial together. Don't worry about being perfect—just have fun!",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 40,
    "idea": "Go on a 'scent adventure': Visit a candle store, perfume shop, or even a grocery store and smell different things together. Pick out a scent that reminds you of each other.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 41,
    "idea": "Create a 'memory lane' walk: Walk around your neighborhood and point out places that have special meaning to your relationship.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 42,
    "idea": "Have a 'dessert crawl': Visit 3 different dessert places and share a small treat at each. Rate them and decide on your new favorite spot.",
    "category": "foodie",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 43,
    "idea": "Do a 'DIY escape room': Create puzzles and clues around your house. Hide a small prize and work together to solve the mystery.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 44,
    "idea": "Write a silly song together: Pick a random topic (like your pets or laundry) and write lyrics. Use a karaoke track and perform it. Bonus: record and save it.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 45,
    "idea": "Try geo-caching in your area: Use a free app to search for hidden objects and messages nearby. Take something small to trade.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 46,
    "idea": "Play the 'Newlywed Game': Write down answers to fun couple questions (like favorite movie, dream vacation) and then see if your partner can guess.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 47,
    "idea": "Go to a local art gallery and pick a painting for each other: Explain why you think it matches them. Then go home and try drawing each other!",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 48,
    "idea": "Volunteer together: Choose a community event or shelter and sign up for a few hours. It's bonding, humbling, and gives you something beautiful to reflect on.",
    "category": "chill",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 49,
    "idea": "Do a 'Surprise Me' drive: Get in the car and take turns saying 'left' or 'right' at intersections. See where you end up and explore that area together.",
    "category": "adventurous",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 50,
    "idea": "Have a 'recreate our first date' night: Wear similar outfits, order the same food, and retell the funniest or most awkward moment from that day.",
    "category": "romantic",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 51,
    "idea": "Plan a 'pajama brunch' at home: Stay in pajamas, cook pancakes and eggs, and play chill music while you eat on the floor picnic-style.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 52,
    "idea": "Try a workout challenge: Do a partner yoga video, TikTok dance, or YouTube bootcamp. Laugh at your fails, and reward yourselves with smoothies.",
    "category": "active",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 53,
    "idea": "Have a 'recreate our first date' night: Wear similar outfits, order the same food, and retell the funniest or most awkward moment from that day.",
    "category": "romantic",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 54,
    "idea": "Do a 'taste test': Buy 3 brands of the same food (chips, chocolate, soda), blindfold each other, and guess which is which. Add bonus points for guessing the flavor.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 55,
    "idea": "Write short love notes on sticky notes and hide them all around your place. Then go on a hunt to find them and read them out loud.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 56,
    "idea": "Take a class together: Pottery, salsa dancing, cake decorating—anything you can do hands-on. Learning together = bonding.",
    "category": "creative",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 57,
    "idea": "Create your own board game: Use cardboard, markers, and dice to build a game based on your relationship or silly dares.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 58,
    "idea": "Plan a 'Netflix Roulette' night: Scroll randomly and pick the first movie neither of you has seen. Watch it and rate it like a critic.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 59,
    "idea": "Recreate a viral TikTok trend together: Whether it's a recipe, dance, or funny skit, film it and enjoy the behind-the-scenes chaos.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 60,
    "idea": "Build a gingerbread house, even if it's not the holidays. Make it competitive, decorate ridiculously, and smash it at the end.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 61,
    "idea": "Take turns planning a 5-minute 'dream vacation pitch.' Describe the perfect getaway, make a fake brochure, and vote on whose wins.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 62,
    "idea": "Go sunrise or sunset skating: Find a park or boardwalk, bring headphones, and skate while the sky changes colors.",
    "category": "active",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 63,
    "idea": "Do a 'vintage date': Dress in retro outfits and go bowling, get milkshakes, or walk around a historical neighborhood pretending it's the 1950s.",
    "category": "fun",
    "budget": "medium",
    "location": "outdoor"
  },
  {
    "id": 64,
    "idea": "Write and mail a love letter to each other, even if you live together. Open them at the same time with snacks and candles.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 65,
    "idea": "Have a bookshop date: Set a timer and each pick a book you think the other will love. Then read the first page to each other in a café.",
    "category": "chill",
    "budget": "medium",
    "location": "indoor"
  },
  {
    "id": 66,
    "idea": "Try a puzzle night: Choose a 500+ piece puzzle, turn on a podcast, and see how long it takes you to finish together.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 67,
    "idea": "Explore your own town like tourists: Visit a landmark you've never been to, take photos, and write fake Yelp reviews of the places you see.",
    "category": "adventurous",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 68,
    "idea": "Do a 'No Complaints' challenge: Spend an entire evening without complaining once. Whoever breaks first owes the other a sweet treat.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 69,
    "idea": "Try painting each other's portraits—but with your non-dominant hands. Display them somewhere, even if they're hilariously bad.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 70,
    "idea": "Find a YouTube karaoke channel and sing duets dramatically. Award each other points for passion, performance, and lyrics.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 71,
    "idea": "Go on a 'silent dinner' date. Try to eat an entire meal without speaking and only using eye contact and gestures.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 72,
    "idea": "Take personality quizzes online and compare results. Laugh at the ones that feel wrong and see what your love languages match.",
    "category": "chill",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 73,
    "idea": "Visit a free museum, walk slowly, and take turns making up stories behind the paintings or exhibits.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 74,
    "idea": "Have a 'technology swap' day: Use each other's phones, laptops, or gaming consoles. See how the other person organizes their digital life.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 75,
    "idea": "Create a couple's vision board: Cut out pictures from magazines or print images that represent your shared goals and dreams.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 76,
    "idea": "Go on a 'scent memory' walk: Visit places that have strong smells (bakery, coffee shop, garden) and talk about what memories they trigger.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 77,
    "idea": "Have a 'breakfast in bed' morning: Cook together in your pajamas and eat while watching the sunrise or a morning show.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 78,
    "idea": "Create a couple's playlist challenge: Each pick 5 songs that remind you of your relationship and explain why you chose each one.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 79,
    "idea": "Do a 'DIY spa day': Make face masks, give each other massages, and relax with calming music and candles.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 80,
    "idea": "Have a 'movie critic' night: Watch a movie and then write reviews as if you're professional critics. Compare your thoughts and ratings.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 81,
    "idea": "Create a couple's bucket list: Write down 50 things you want to do together, from small daily activities to big adventures.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 82,
    "idea": "Go on a 'photo story' walk: Take turns taking photos and then create a story using all the images you captured.",
    "category": "creative",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 83,
    "idea": "Have a 'comfort food' night: Each of you makes your favorite comfort food and shares the story behind why you love it.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 84,
    "idea": "Each pick a charity and spend 20 minutes pitching it to each other. Then donate $5 to the one that wins.",
    "category": "chill",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 85,
    "idea": "Print a coloring sheet and color it together while sipping tea. Bonus: Use crayons for nostalgia.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 86,
    "idea": "Try a 'partner interview': One person pretends to be famous, the other plays a journalist. Record the whole silly thing.",
    "category": "fun",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 87,
    "idea": "Create a relationship map: Draw your journey together with markers or paint, from how you met to where you are now.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 88,
    "idea": "Go to an open mic night: Watch strangers perform poetry, comedy, or music. Optional: Sign up for the ultimate brave date.",
    "category": "cultural",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 89,
    "idea": "Have a 'midnight snack' adventure: Stay up late and make comfort food together while watching something silly on TV.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 90,
    "idea": "Make your own mocktail or cocktail recipes: Give them fun names and write the recipes down in a shared notebook.",
    "category": "foodie",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 91,
    "idea": "Each pick a one-hour playlist and listen to both during an outdoor walk or indoor chill night.",
    "category": "chill",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 92,
    "idea": "Start a couple's journal: Answer one prompt together each week. First one: 'What made you smile about us this month?'",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 93,
    "idea": "Visit a dog park even if you don't have a dog. Watch the chaos, pick your favorite pups, and enjoy coffee on a bench.",
    "category": "fun",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 94,
    "idea": "Go to a free workshop at a local store (home depot, art center, library). Try something random together.",
    "category": "creative",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 95,
    "idea": "Create a 'memory jar': Write down happy moments on slips of paper and put them in a jar. Read them together on special occasions.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 96,
    "idea": "Have a 'technology detox' day: Put away all devices and focus on each other. Play games, cook, or just talk without distractions.",
    "category": "chill",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 97,
    "idea": "Go on a 'scent adventure': Visit places with strong smells (bakery, coffee shop, garden) and talk about what memories they trigger.",
    "category": "romantic",
    "budget": "low",
    "location": "outdoor"
  },
  {
    "id": 98,
    "idea": "Have a photo sorting night: Go through your phone galleries or old albums together. Make a shared digital album.",
    "category": "cozy",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 99,
    "idea": "Each write a short letter to open in 6 months. Seal them together and hide them in a drawer.",
    "category": "romantic",
    "budget": "low",
    "location": "indoor"
  },
  {
    "id": 100,
    "idea": "Try a 'restaurant at home' night: Set the table like a fancy place, dress up, and serve each other in courses.",
    "category": "romantic",
    "budget": "medium",
    "location": "indoor"
  }
]
